loipc98/Nuvoton_N76E003/ADC_PWM/main.c
#include "N76E003.h"
#include "Common.h"
#include "Delay.h"
#include "SFR_Macro.h"
#include "Function_define.h"
 char chu_so[]={0xEB,0x88,0xB3,0xBA,0xD8,0x7A,0x7B,0xA8,0xFB,0xFA};
#define DATA P03			//Du lieu 
#define CLK P15				//Xung 
#define LAT P17				//Chot du lieu de day ra 
#define LED1 P13
#define LED2 P12
#define LED3 P11
#define LED4 P10
#define bat  0
#define tat  1
int cnt = 0;
unsigned long adc_value;
void HC595_Output(unsigned char a)
{
	unsigned char i;
	for (i=0; i<8;i++)
	{
		DATA = a & (0x80 >> i);		//Dich bit de day du lieu ra
		CLK=0;
		CLK=1;
	}
	LAT=0;
	LAT=1;
}

void PWM_set_period(unsigned int period_value)
{
	PWMPL = period_value & 0x00FF;
	PWMPH = (period_value & 0xFF00)>>8;
}

void PWM_set_on(unsigned int on_value)
{
	PWM2L = (on_value & 0x00FF);
  PWM2H = ((on_value & 0xFF00) >> 8);
  set_LOAD;
}

int i;
void Timer0_Interrupt() interrupt 1
{
	TH0=0xFA;				//Nap lai gia tri 
	TL0=0xCB;
	cnt++;
	if(cnt==5) cnt=1;
	if(cnt==1)
	{
		LED4=tat;
		LED1=tat;
		HC595_Output(chu_so[adc_value/1000]);
		LED4=bat;
	}
 if(cnt==2)
	{
		LED3=tat;
		LED4=tat;
		HC595_Output(chu_so[(adc_value%1000)/100]);
		LED3=bat;
	}
 if(cnt==3)
	{
		LED2=tat;
		LED3=tat;
		HC595_Output(chu_so[(adc_value%100)/10]);
		LED2=bat;
	}
 if(cnt==4)
	{
		LED1=tat;
		LED2=tat;
		HC595_Output(chu_so[adc_value%10]);
		LED1=bat;
	}
}
void main(void)
{
	P30_Input_Mode;
	P05_Quasi_Mode;					
	P10_Quasi_Mode;				//LED4 Output
	P11_Quasi_Mode;				//LED3 Output
	P12_Quasi_Mode;				//LED2 Output
	P13_Quasi_Mode;				//LED1 Output
	P15_Quasi_Mode;				//CLK  Output
	P17_Quasi_Mode;				//LAT  Output
	P03_Quasi_Mode;				//DATA Output
	PWM2_P05_OUTPUT_ENABLE;
	PWM_IMDEPENDENT_MODE;
	PWM_CLOCK_DIV_8;
	PWM_set_period(2000);
	// Khoi tao ngat Timer0
	TMOD=0x01;						//Khoi tao Timer Mode 1
	ET0=1;								//Cho phep ngat Timer
	EA=1;									//Cho phep ngat toan cuc
	TR0=1;								//Khoi tao Timer0
	// Khoi tao ADC
	Enable_ADC_AIN5; 			//Khoi tao ADC pin 04
	PWM2H = 0x00;
  PWM2L = 0x00;
  set_LOAD;
  set_PWMRUN;
	while(1)
	{
		P05=1;										
		clr_ADCF;									// Xoa co, neu ADCF=1 thi ko the chuyen doi 
		set_ADCS;									// ADCS=1 trong suot qua trinh chuyen doi, 
    while(ADCF == 0);					// ADCF = 0, chuyen doi hoan tat
    adc_value = ADCRH;
    adc_value <<= 4;
    adc_value |= ADCRL;		// Doc gia tri ADC
		PWM_set_on(adc_value*2000/4096);
		Timer0_Delay1ms(100);
	}
}